# coding: utf-8
#   cities = City.create([{ name: 'Chicago' }, { name: 'Copenhagen' }])
#   Mayor.create(name: 'Emanuel', city: cities.first)

@users = []
@tags = []


@users[0] = ["てぃんくる","texinkuru"]
 @tags[0] = ["季節","ロリ","はるかぜせつな","ベル","眠れる森のお姫様","透き通るように美しく細かいロリ","グラデーション","レース","ドレス","ゴスロリ","女性キャラ","白の少女","クッキー","カナリヤ","バレンタイン","細かい","和服","アリス","版画","絵師100人展"]
 
@users[1] = ["藤真拓哉","fujima"]
 @tags[1] = ["魔法少女","ロリ","Essentia","幼女","ぴょんぴょん","砲火後ティータイム","アイマス","ゲーム","くまぱん","けいおん","Fate","μ's","あずにゃん","ヴァルキリー","ラブライブ","ラノベ","comic1","ココア","白タイツ","初音ミク","フレイヤ","FGO","ぷにとー","水着","ご注文はうさぎですか？","艦これ","SAO"]

@users[2] = ["蒼樹うめ","aoki"]
 @tags[2] = ["4コマ漫画","ねこねこソフト","うめてんてー","うめ先生","サナララ","ドージンワーク","さよなら絶望先生","ほんわか","るゆふわ","魔法少女まどかマギカ","てつなぎこおに。","笑顔ふたつ","諸葛瑾","マドの向こう側","ひだまりスケッチ","かんなぎ","デフォルメ","へちょ絵","きゅうべえ","佐倉杏子","まどか"]

@users[3] = ["秋空もみぢ","akizora"]
 @tags[3] = ["艦これ","この素晴らしい世界に祝福を！","尻","尻神様","漫画","R-18","うさぎ","シャルロット","ビスマルク","テイルズ","ニーソ","レオタード","ワンピース","ソックス","白ソックス","白ニーソックス","東方","響","連装砲ちゃん","ボディースーツ","SAO","鍵山","例大祭","オリジナル"]
 
@users[4] = ["浅海朝美","asaiumi"]
 @tags[4] = ["オリジナル"]
 
@users[5] = ["あなぽん","anapon"]
 @tags[5] = ["ロリ","アニメ","パステル","コミケ","オリジナル","靴下"]

@users[6] = ["有葉","ariha"]
 @tags[6] = ["艦これ","オリジナル","パステル","ロリ","うさぎ","R-18","こんな娘がいたら僕はもう…!!","柔らかい","ソフト","淡い","柔らかくソフト","少女漫画","デフォルメ","シリアス","純愛","純粋","いちゃらぶ","陵辱"]

@users[7] = ["Anmi","anmi"]
 @tags[7] = ["染み渡る","癒される","淡い","パステル","可愛い","綺麗","泣いた","神々しい","季節","春","ソシャゲ","擬人化","鳥の擬人化","鳥","海","浜辺","夏"]
 
@users[8] = ["唯々月たすく","tasuku"]
 @tags[8] = ["エロゲ","R-18","しこい"]
 
@users[9] = ["wingheart","wingheart"]
 @tags[9] = ["現実的","現実の中の幻想","幻想","幻想的","ひかり","光","ブリキ","シスコン","近親相姦","ヨスガル","ヨスガノソラ","銀髪","ロリ","エロ","兄弟愛","アナログ絵"]
 
@users[10] = ["植田和幸","ueta"]
 @tags[10] = ["きんいろモザイク","ロリ","金髪","黒髪","イギリス","洋ロリ","夏","水着","ニーソ","黒ニーソ","白ニーソ","銀髪","制服","バスタオル","湯上り"]
 
@users[11] = ["ウエダハジメ","hajime"]
 @tags[11] = ["化物語","魔法少女まどか☆マギカ","ラフ","ラフなタッチ","線画","モノトーン","ダーク","ダークファンタジー","幻想的","ファンタジー","絶望","悲しみ","喜び","血","世界観","世界","一度見たら忘れない","銀髪","ロリ"]
 
@users[12] = ["植田亮","ryo"]
 @tags[12] = ["R-18","キャラデザイン","Canvas〜セピア色のモチーフ〜","制服","アリス","ロリ","妖夢","東方","和服","うさぎ","ナース","ニーソ","縞ニーソ","縞パン"]
 
@users[13] = ["うたたねひろゆき","utatane"]
 @tags[13] = ["天獄","EVA","新世紀エヴァンゲリオン","美少女戦士セーラームーンS","１９００年代","セーラー服","ロボット","マシン","綾波","銀髪","アスカ","魔法少女","天使"]
 
@users[14] = ["ERIMO","erimo"]
 @tags[14] = ["艦これ","フラン","東方","ロリ","ゴスロリ","幻想","芸術","初音ミク","VOCALOID","夏","海","水着"]
 
@users[15] = ["えれっと","eretto"]
 @tags[15] = ["艦これ","フリル","髪の毛","瞳","水着","ロリ","駆逐艦","銀髪","スク水","にゃんぱす","夏祭り","ゆかた"]
 
@users[16] = ["岡崎武士","okazaki"]
 @tags[16] = ["ロリ","黒髪","ワンピ","白いワンピース","精霊使い","電脳天使"]
 
@users[17] = ["okama","okama"]
 @tags[17] = ["衣装","デザイン","キャラデザ","ロリ","絵師100人展","武装神姫","ハヤテのごとく","神曲奏界ポリフォニカ","アリス","かみちゅ","ケロロ軍曹","プリティーリズム・レインボーライブ","幻想的","色","色使い","黒髪"]
 
@users[18] = ["小原トメ太","tome"]
 @tags[18] = ["ロリ","緑髪","VOCALOID","淡い","GUMI","制服","縞ニーソ","白ニーソ","ニーソ","桜","季節","ガールフレンド（仮）","天体のメソッド ","えとたま","レガリア The Three Sacred Stars"]
 
@users[19] = ["CARNELIAN","carn"]
 @tags[19] = ["年齢層","洋服","ファッション","服装","エッチ","陵辱","純愛","繊細","綿密","BL","乙女","乙女ゲー","ゲーム"]
 
@users[20] = ["片桐雛太","kata"]
 @tags[20] = ["ロリ","巨乳","ゴスロリ","恋姫無双","和服","呉服","刀","武器","長髪","銀髪","銀髪","ニーソ","水着","エロ","R-18"]
 
@users[21] = ["上条衿","kami"]
 @tags[21] = ["一度見たら忘れない","線画","モノトーン","ゴスロリ","蝶","黒髪","目","制服","淡い","幻想","芸術"]
 
@users[22] = ["karory","karory"]
 @tags[22] = ["ロリ","ニーソ","メイド","制服","アリス","幻想","金髪","銀髪","絶対領域","和服","桜","うさみみ","うさぎ","兎","海","水着","ハロウィン","赤ずきん","魔女","魔法少女","ツインテール","下着"]
 
@users[23] = ["切符","kippu"]
 @tags[23] = ["ラノベ","挿絵","のうりん","淡い","ハレの日は学校を休みたい!","ゴスロリ"]
 
@users[24] = ["kirero","kirero"]
 @tags[24] = ["ゴスロリ","魔法少女","ロリ","妖夢"]
 
@users[25] = ["ぎん太","ginta"]
 @tags[25] = ["淡い","ロリ","黒ニーソ","制服","濡れる","濡れた","水辺"]
 
@users[26] = ["ぎん太郎","tarou"]
 @tags[26] = ["艦これ","海","巨乳","猫ランジェリー","猫耳","武器","ろーちゃん","スク水"]
 
@users[27] = ["空中幼彩","yousai"]
 @tags[27] = ["ロリ","空","季節","海","夏","制服","巫女","銀髪","金髪"]
 
@users[28] = ["KEI","kei"]
 @tags[28] = ["初音ミク","ロリ","VOCALOID","空","ゲーム"]

@users[29] = ["keg","keg"]
 @tags[29] = ["幻想","武器","空","鳥","魔法少女","和服","秋","銃"]
 
@users[30] = ["珈琲貴族","coffe"]
 @tags[30] = ["ブルマ","体育着","制服","おっぱい","猫耳","体操着","下着","オリジナル","黒髪","長髪","しぶりん"]
 
@users[31] = ["桜木蓮","sakura"]
 @tags[31] = ["桜","ピンク髪","緑髪","制服","武器","幻想","ロリ","庭","果実","イギリス"]
 
@users[32] = ["さくら小春","koharu"]
 @tags[32] = ["制服","メイド","黒髪","和服","幻想"]
 
@users[33] = ["桜沢いづみ","idumi"]
 @tags[33] = ["下着","ロリ","ゴスロリ","銀髪","制服","刀","武器","金髪","幻想"]
 
@users[34] = ["左近堂絵里","konoe"]
 @tags[34] = ["腐向け","配色","色使い","男性","銀髪","ショタ","パンダ"]
 
@users[35] = ["笹井さじ","sasai"]
 @tags[35] = ["ロリ","淡い","銀髪","銀髪","水着","メイド","巫女","パンツ","もふもふ","ねこみみ","茅野","ごちうさ","くまみみ","オリジナル","艦これ","ティッピー","R-18"]
 
@users[36] = ["G ユウスケ","g"]
 @tags[36] = ["和服","和風","巫女","戦国","武器","銀髪","江戸","物語","刀","制服"]

@users[37] = ["シヴァ。","siva"]
 @tags[37] = ["R-18","オリジナル","ブリキ","おへそ","ラブライブ","なにこれかわいい","おっぱい"]

@users[38] = ["士貴智志","siki"]
 @tags[38] = ["和風","ジャンプ","進撃の巨人","銃","バトル","コミック"]

@users[39] = ["茨乃","sino"]
 @tags[39] = ["SAO","女の子","艦これ","VOCALOID","アールグレイ","sai"]

@users[40] = ["Syroh","syroh"]
 @tags[40] = ["猫耳","ロリ","猫ランジェリー","水着","銀髪","黒髪","ピンク髪","巨乳","おっぱい","パジャマ","クッキー"]

@users[41] = ["白もち桜","moti"]
 @tags[41] = ["銀髪","黒髪","ニーソ","靴下","猫耳","銀髪","魔法少女","ゆるふわ","オッドアイ","水着","秋","魔女帽","魔女っ子","うさみみ","兎"]

@users[42] = ["しらたま","siratama"]
 @tags[42] = ["ロリ","ゆるふわ","ソフトタッチ","九条カレン","アリス","貧乳","茅野","くまみみ","ねこみみ","銀髪","金髪","素足","パステル","制服"]

@users[43] = ["庄名泉石","shona"]
 @tags[43] = ["R-18","制服","お嬢様","おっぱい","黒髪","眼帯","銀髪","お姉様","兎","うさぎ","クリスマス","女の子","セーラー服","ポニーテール","水着","猫耳","着物","雪"]

@users[44] = ["瀬口たかひろ","taka"]
 @tags[44] = ["雑誌","水着","漫画","ショタ","姉","お姉ちゃん","妹","ツインテール"]

@users[45] = ["瀬口たかひろ","takano"]
 @tags[45] = ["細かい","線画","海","空","幻想的","透き通るように美しく細かいロリ","制服","イラスト","Claris","音楽","音で彩る","アーティストイラスト","CDジャケット","現実の中の幻想","現実の中にリアルがある","ドレス","パステル"]

@users[46] = ["Choco","choco"]
 @tags[46] = ["ロボット","銃","刀","黒髪","ツインテール","IS","銀髪","水着","銃","戦闘","幻想"]

@users[47] = ["ちり","tiri"]
 @tags[47] = ["VOCALOID","漫画","看板娘","縞パン","首輪","猫耳","水着","ゴスロリ","ピンク髪","貧乳","黒髪","黒パン","音ゲー","音楽","おへそ"]

@users[48] = ["てんまそ","ten"]
 @tags[48] = ["R-18","，巫女","海","水着","幻想的","天使","羽","おっぱい","ツインテール"]

@users[49] = ["トモセシュンサク","tomo"]
 @tags[49] = ["水着","ウェスタン","ピンク髪","ショートヘア","ボーイッシュ","R-18"]

@users[50] = ["なかじまゆか","naka"]
 @tags[50] = ["ロリ","パパ聞き","ゴスロリ","ツインテール","金髪","おいたん","銀髪","オッドアイ"]

@users[51] = ["Na-ga","na-ga"]
 @tags[51] = ["天使","Key","制服","銀髪","ロリ","マジ天使","銃","刀","ハンドソニック","ピンク髪","ギター","クラナドは人生","人生","猫","猫耳","白ニーソ","ニーソ","黒ニーソ"]

@users[52] = ["夏彦","natu"]
 @tags[52] = ["メーテラ","モンスーノ","艦これ","ケモミミ","獣","猫耳","狼耳","しっぽ"]

@users[53] = ["なつめえり","eri"]
 @tags[53] = ["制服","夏","街並み","黒髪","スカート","海","艦これ","ロリ","vivid"]

@users[54] = ["ななかまい","nanaka"]
 @tags[54] = ["赤髪","海","水着","制服","刀","ピュアガール","妹","猫耳","R-18","陵辱","露出","俺妹","黒猫"]

@users[55] = ["ニリツ","niritu"]
 @tags[55] = ["VOCALOID","オリジナル","艦これ","魔法少女","制服","下着","はだける","ショートカット","ボーイッシュ","下着","風景","朝","冬"]

@users[56] = ["バーニア600","bar"]
 @tags[56] = ["電車","列車","車両","風景","幻想的","幻想","背景","制服","花火","夏","おっぱい","壁紙","一度見たら忘れない","ブリキ"]

@users[57] = ["早川ハルイ","harui"]
 @tags[57] = ["アニメ塗り","機械","ロボット","魔法少女リリカルなのは","女の子"]

@users[58] = ["ぱん","pan"]
 @tags[58] = ["ぱんのみみ","ゆるふわ","ロリ","猫耳","うさみみ","パステル","メイド","ピンク髪","金髪","銀髪","ゴスロリ","夏","季節","OCF"]

@users[59] = ["晩杯あきら","akira"]
 @tags[59] = ["一度見たら忘れない","線画","色使い","ヴィジュアル系","ロリ","ゴスロリ","テライケメン","勝てる気がしない","東方","カリスマ","オリジナル","溢れ出るカリスマ"]

@users[60] = ["p-19","p"]
 @tags[60] = ["艦これ","おへそ","オリジナル","女の子","狐耳","ケモミミ","獣耳","響","R-18","駆逐艦","ぱんつ","ロリ","巨乳","ゆり","銀髪","金髪","はいてない"]

@users[61] = ["緋色雪","hiiro"]
 @tags[61] = ["着物","和服","黒髪","ポニテ","メガネ","刀","ゴスロリ","妖精","ファンタジー","幻想","幻想的","ロリ"]

@users[62] = ["樋上いたる","itaru"]
 @tags[62] = ["key","制服","人生","クラナドは人生","AIR","もう，ゴールしてもいいよね","黒髪","あう","がおー","猫耳","幻想的"]

@users[63] = ["日吉丸晃","hiyosi"]
 @tags[63] = ["腐向け","ショートカット","イケメン","テライケメン","BL"]

@users[64] = ["広江礼威","hiroe"]
 @tags[64] = ["銃","一度見たら忘れない","メイド","戦争","ブラックラグーン","刀","機械"]

@users[65] = ["ピロ水","piro"]
 @tags[65] = ["夏","水着","おっぱい","東方","艦これ","R-18","桜","和服","お酒","花見","下着","浜辺","シンデレラ"]

@users[66] = ["フカヒレ","fuka"]
 @tags[66] = ["冬","ゆり","百合","制服","銀髪","シンデレラ","夏","AIR","もう，ゴールしてもいいよね","羽","東方","こいし","ロリ","ショタ"]

@users[67] = ["フミオ","fmo"]
 @tags[67] = ["グリザイアの果実","赤髪","ピンク髪","お姉ちゃん","ショタ","銃","刀","戦闘","姫","お姉様","近親相姦"]

@users[68] = ["ぺこ","peco"]
 @tags[68] = ["ゆり","百合","桜Trick","桜","春","ピンク髪","和服","茅野","その花びらに口づけを","東方","艦これ","はいてない"]

@users[69] = ["べっかんこう","suzuki"]
 @tags[69] = ["鈴木","大図書館の羊飼い","銀髪","ロリ","嬉野さん","おっぱい","ツインテール","金髪","ピンク髪","同じ絵なきがする"]

@users[70] = ["紅緒","benio"]
 @tags[70] = ["オリジナル","幻想的","幻想","猫耳","光","金髪","制服","赤髪","ゴスロリ"]

@users[71] = ["ぽよよん♡ろっく","poyo"]
 @tags[71] = ["ロリ","水着","ツインテール","スク水","黒髪"]

@users[72] = ["魔太郎","matarou"]
 @tags[72] = ["艦これ","おっぱい","R-18","制服","水着","シンデレラ","ぱんつ","アイドル"]

@users[73] = ["茉宮祈芹","iida"]
 @tags[73] = ["R-18","着物","和服","クロシェット","ピンク髪","ゴスロリ","東方","ツインテール","祭り","夏"]

@users[74] = ["まんごープリン","mango"]
 @tags[74] = ["艦これ","ロリ","BL","漫画","海","夏","おっぱい"]

@users[75] = ["Mika Pikazo","mika"]
 @tags[75] = ["一度見たら忘れない","芸術","幻想","和服","ショートヘア","ボーイッシュ","ロリ","艦これ","海","猫耳","シンデレラ"]

@users[76] = ["美樹本晴彦","miki"]
 @tags[76] = ["一度見たら忘れない","風景"]

@users[77] = ["三嶋くろね","kurone"]
 @tags[77] = ["幻想的","このすば","白髪","銀髪","ロリ","メイド","猫耳","ゆり","百合","魔女っ子"]

@users[78] = ["MITAONSYA","mita"]
 @tags[78] = ["ロリ","銀髪","金髪","和服","ゆるふわ","魔女っ子","ピンク髪","正月"]

@users[79] = ["みづきたけひと","take"]
 @tags[79] = ["夏","制服"]

@users[80] = ["三輪フタバ","miwa"]
 @tags[80] = ["ロリ","駆逐艦","銀髪","ニーソ","茅野","東方","はいてない","ごちうさ","フラン"]

@users[81] = ["MIN-NARAKEN","min"]
 @tags[81] = ["イラスト","ニーソ","バニー","黒ニーソ"]

@users[82] = ["もとみやみつき","miya"]
 @tags[82] = ["ゆるふわ","ロリ","猫耳","おっぱい","艦これ","ピンク髪","銀髪","ツインテール"]

@users[83] = ["もりのほん","mori"]
 @tags[83] = ["東方","ブリキ","獣耳","メイド","狐","狐耳"]

@users[84] = ["夜ノみつき","yoru"]
 @tags[84] = ["猫耳","青髪","ロリ","艦これ","幻想的","オッドアイ","銀髪","金髪","羽","ピンク髪","おっぱい","ケモミミ"]

@users[85] = ["憂姫はぐれ","hagure"]
 @tags[85] = ["和服","艦これ","狐耳","ケモミミ","ピンク髪","シンデレラ","ドレス","金髪","ツインテール"]

@users[86] = ["ゆーげん","yugen"]
 @tags[86] = ["幻想的","綺麗","風景","銃","SAO","魔法少女","アイドル","黒髪","ツインテール"]

@users[87] = ["夕薙","yunagi"]
 @tags[87] = ["幻想的","おっぱい","黒髪","黒服","かっこいい"]

@users[88] = ["ゆき恵","yukie"]
 @tags[88] = ["猫","猫耳","メイド","ロリ","ゆるふわ","金髪","銀髪","和服","ケモミミ"]

@users[89] = ["yuki＊Mami","mami"]
 @tags[89] = ["幻想的","一度見たら忘れない"]

@users[90] = ["柚子奈ひよ","yuzu"]
 @tags[90] = ["夏","幻想的","風景","エロゲ","ひまわり","制服","黒髪"]

@users[91] = ["ゆらん","yuran"]
 @tags[91] = ["一度見たら忘れられない","幻想的","細かい","ピンク髪","ツインテール"]

@users[92] = ["よしづきくみち","miti"]
 @tags[92] = ["オリジナル","セーラー服","光","森","素足","足","背景","虹","魔女","魔女っ子"]

@users[93] = ["蘭宮涼","ran"]
 @tags[93] = ["独特"]

@users[94] = ["りいちゅ","rityu"]
 @tags[94] = ["幻想的","一度見たら忘れられない","ロリ","フラン","東方","魔女","巫女","和服","羽","景色","背景"]

@users[95] = ["るび様","rubi"]
 @tags[95] = ["おっぱい","ぱんつ","ロリ","黒髪","メイド","銀髪","猫","猫耳"]

@users[96] = ["るろお","ruro"]
 @tags[96] = ["ダーク","くらい","暗闇","ファンタジー","ロリ","黒髪"]

@users[97] = ["れい亜","reia"]
 @tags[97] = ["ゆるふわ","ロリ","金髪","猫耳","メイド","ピンク髪","アリス","東方"]

@users[98] = ["6U☆","roku"]
 @tags[98] = ["東方","はね","羽","ロリ","制服","靴下","白ニーソ","幻想的"]

@users[99] = ["和錆","wasabi"]
 @tags[99] = ["ロリ","ピンク髪","魔法少女","魔女","羽","銀髪"]

@users[100] = ["わたがしゆい","wata"]
 @tags[100] = ["祭り","和服","ロリ","金髪","銀髪"]


for i in 0..@users.count-1 do
    @avatar = File.new(File.join(Rails.root, "app/assets/images/default_avatar/"+@users[i][1]+"_a.jpg"))
    @picture = File.new(File.join(Rails.root, "app/assets/images/default_picture/"+@users[i][1]+"_p.jpg"))
    @work = File.new(File.join(Rails.root, "app/assets/images/default_work/"+@users[i][1]+"_w.jpg"))
    @user = User.create(name: @users[i][0],email: @users[i][1]+'@gmail.com',avatar: @avatar,work: @work,picture: @picture ,age: 1 ,password: "ko",creator: true)
    
    for i2 in 0..@tags[i].count-1
        if Tag.find_by(name: @tags[i][i2])!=nil
            @tag = Tag.find_by(name: @tags[i][i2])
        else
            @tag = Tag.create(:name => @tags[i][i2])
        end
        Draw.create(user_id: @user.id,tag_id: @tag.id)
    end
end